Обработки/Reports/_РасчетнаяСтоимостьПаяИСЧА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасчетнаяСтоимостьПаяИСЧА</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрытьШапку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОтчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отчеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасчетнаяСтоимостьПаяИСЧА/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Сообщение о расчетной стоимости пая и СЧА ПИФ",
		"1.8",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Возврат Настройки;

КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Фиксируем запуск процедуры
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления"); 
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
#Область Запрос

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ _КлиентДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&Период,
		|			ВЫБОР
		|				КОГДА &СчетДоверительногоУправления = ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.)
		|					ТОГДА (ВЫРАЗИТЬ(Клиент КАК Справочник.ПаевыеИнвестиционныеФонды)) = &ПаевойИнвестиционныйФонд
		|				ИНАЧЕ СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			КОНЕЦ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицОрганизации.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеОрганизации,
		|	РеквизитыЮридическихЛицОрганизации.ПолноеНаименованиеПоУставу КАК Организация,
		|	СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.ДатаВыдачи КАК ДатаЛицензии,
		|	СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.Серия + "" "" + СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.Номер КАК НомерЛицензии,
		|	ЮридическийАдрес.Представление КАК ЮрАдресОрганизации,
		|	Телефон.Представление КАК ТелефонОрганизации,
		|	ВебСтраница.Представление КАК СайтОрганизации,
		|	ВЫБОР
		|		КОГДА _КлиентДоверительногоУправления.Клиент.ОрганУтвердившийПравила = ЗНАЧЕНИЕ(Перечисление.РегуляторыРынкаЦенныхБумаг.)
		|			ТОГДА ""Банком России""
		|		КОГДА _КлиентДоверительногоУправления.Клиент.ОрганУтвердившийПравила = ЗНАЧЕНИЕ(Перечисление.РегуляторыРынкаЦенныхБумаг.ФКЦБ)
		|			ТОГДА ""ФКЦБ""
		|		ИНАЧЕ ""ФСФР""
		|	КОНЕЦ КАК ОрганРегистрацииПравил,
		|	_КлиентДоверительногоУправления.Клиент.НомерПравил КАК НомерПравил,
		|	_КлиентДоверительногоУправления.Клиент.ДатаПравил КАК ДатаПравил,
		|	РеквизитыПИФСрезПоследних.ПолноеНаименованиеФонда КАК НаименованиеФонда,
		|	_КлиентДоверительногоУправления.Клиент КАК ПИФ,
		|	_КлиентДоверительногоУправления.Клиент.Код КАК КодПИФ,
		|	_КлиентДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|			&Период,
		|			ЮрФизЛицо = &ЮрФизЛицо
		|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЛицензий.СрезПоследних(
		|				&Период,
		|				Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов.Действует)
		|					И Лицензия.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюИнвестиционнымиФондамиПИФиНПФ)) КАК СтатусыЛицензийОрганизацииСрезПоследних
		|		ПО РеквизитыЮридическихЛицОрганизации.ЮрФизЛицо = СтатусыЛицензийОрганизацииСрезПоследних.Лицензия.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдрес)) КАК ЮридическийАдрес
		|		ПО РеквизитыЮридическихЛицОрганизации.ЮрФизЛицо = ЮридическийАдрес.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.Телефон)) КАК Телефон
		|		ПО РеквизитыЮридическихЛицОрганизации.ЮрФизЛицо = Телефон.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ВебСтраница)) КАК ВебСтраница
		|		ПО РеквизитыЮридическихЛицОрганизации.ЮрФизЛицо = ВебСтраница.Объект,
		|	_КлиентДоверительногоУправления КАК _КлиентДоверительногоУправления,
		|	РегистрСведений.РеквизитыПИФ.СрезПоследних(
		|			&Период,
		|			ПаевойИнвестиционныйФонд В
		|				(ВЫБРАТЬ
		|					_КлиентДоверительногоУправления.Клиент
		|				ИЗ
		|					_КлиентДоверительногоУправления)) КАК РеквизитыПИФСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(Показатели_СтоимостьПая.Значение, 0) КАК СтоимостьПая,
		|	Показатели_СтоимостьПая.Период КАК ДатаРасчета,
		|	ПредПоказатели_СтоимостьПая.Период КАК ПредДатаРасчета,
		|	ЕСТЬNULL(Показатели_СЧА.Значение, 0) КАК СЧА,
		|	ЕСТЬNULL(ПредПоказатели_СтоимостьПая.Значение, 0) КАК ПредСтоимостьПая,
		|	ЕСТЬNULL(ПредПоказатели_СЧА.Значение, 0) КАК ПредСЧА
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели КАК Показатели_СтоимостьПая
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК Показатели_СЧА
		|		ПО ((ВЫРАЗИТЬ(Показатели_СтоимостьПая.СубъектАналитики КАК Справочник.СчетаДоверительногоУправления)) = (ВЫРАЗИТЬ(Показатели_СЧА.СубъектАналитики КАК Справочник.СчетаДоверительногоУправления)))
		|			И Показатели_СтоимостьПая.Период = Показатели_СЧА.Период
		|			И (Показатели_СЧА.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели.СрезПоследних(
		|				&ПредПериод,
		|				Организация = &Организация
		|					И ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая)) КАК ПредПоказатели_СтоимостьПая
		|		ПО ((ВЫРАЗИТЬ(Показатели_СтоимостьПая.СубъектАналитики КАК Справочник.СчетаДоверительногоУправления)) = (ВЫРАЗИТЬ(ПредПоказатели_СтоимостьПая.СубъектАналитики КАК Справочник.СчетаДоверительногоУправления)))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели.СрезПоследних(
		|				&ПредПериод,
		|				Организация = &Организация
		|					И ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)) КАК ПредПоказатели_СЧА
		|		ПО ((ВЫРАЗИТЬ(Показатели_СтоимостьПая.СубъектАналитики КАК Справочник.СчетаДоверительногоУправления)) = (ВЫРАЗИТЬ(ПредПоказатели_СЧА.СубъектАналитики КАК Справочник.СчетаДоверительногоУправления)))
		|ГДЕ
		|	Показатели_СтоимостьПая.Период = &Период
		|	И Показатели_СтоимостьПая.Организация = &Организация
		|	И ВЫРАЗИТЬ(Показатели_СтоимостьПая.СубъектАналитики КАК Справочник.СчетаДоверительногоУправления) В
		|			(ВЫБРАТЬ
		|				_КлиентДоверительногоУправления.СчетДоверительногоУправления
		|			ИЗ
		|				_КлиентДоверительногоУправления)
		|	И Показатели_СтоимостьПая.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая)";
		
#КонецОбласти

#Область ВыводОтчёта

	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЮрФизЛицо"					, ЭтотОбъект.Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("ПаевойИнвестиционныйФонд"	, ЭтотОбъект.ПаевойИнвестиционныйФонд);
	Запрос.УстановитьПараметр("Организация"					, Организация);
	Запрос.УстановитьПараметр("Период"						, Период);
	Запрос.УстановитьПараметр("ПредПериод"					, Период - 1);
	
	ПакетОтчетов = Запрос.ВыполнитьПакет();
	
	Макет = ПолучитьМакет("Макет");
	ОбластьОтчет 	= Макет.ПолучитьОбласть("Отчет");
	ОбластьПодвал 	= Макет.ПолучитьОбласть("Подвал");
	
	ВыборкаШапка = ПакетОтчетов[1].Выбрать();
	Если ВыборкаШапка.Следующий() Тогда
		ОбластьОтчет.Параметры.Заполнить(ВыборкаШапка);
		ОбластьОтчет.Параметры.ДатаПравил 	= Формат(ВыборкаШапка.ДатаПравил, 	"ДФ=dd.MM.yyyy");
		ОбластьОтчет.Параметры.ДатаЛицензии = Формат(ВыборкаШапка.ДатаЛицензии, "ДФ=dd.MM.yyyy");
		
		// Из телефонов оставим первый
		Телефоны = ВыборкаШапка.ТелефонОрганизации;
		ПервыйРазделитель = СтрНайти(Телефоны, ",");
		Если ПервыйРазделитель > 0 Тогда
			Телефоны = СокрЛП(Лев(Телефоны, ПервыйРазделитель-1));
		КонецЕсли;
		ОбластьОтчет.Параметры.ТелефонОрганизации = Телефоны;
	КонецЕсли;
	
	ВыборкаПоказатели = ПакетОтчетов[2].Выбрать();
	Если ВыборкаПоказатели.Следующий() Тогда
		ОбластьОтчет.Параметры.Заполнить(ВыборкаПоказатели);
		
		// Проценты рассчитаем отдельно
		ПроцентСтоимостиПая 							= ?(ВыборкаПоказатели.ПредСтоимостьПая = 0, 0, ВыборкаПоказатели.СтоимостьПая / ВыборкаПоказатели.ПредСтоимостьПая) * 100;
		ОбластьОтчет.Параметры.ИзменениеСтоимостиПая 	= ?(ПроцентСтоимостиПая = 0, 0, Окр(ПроцентСтоимостиПая - 100, 2, 1));
		
		ПроцентСЧА 										= ?(ВыборкаПоказатели.ПредСЧА = 0, 0, ВыборкаПоказатели.СЧА / ВыборкаПоказатели.ПредСЧА) * 100;
		ОбластьОтчет.Параметры.ИзменениеСЧА 			= ?(ПроцентСЧА = 0, 0, Окр(ПроцентСЧА - 100, 2, 1));
		
	КонецЕсли;
	
	ДокументРезультат.Вывести(ОбластьОтчет);
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
		
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ОбластьПодвал.Параметры.Подписант 			= СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
		ОбластьПодвал.Параметры.ПодписантДолжность 	= СтруктураДанныхКонтактногоЛица.Должность;	
	КонецЕсли;                                                                         	

	ДокументРезультат.Вывести(ОбластьПодвал);
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя(), , ОриентацияСтраницы.Портрет);	
	
#КонецОбласти

	// Фиксируем завершение процедуры
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	
	
КонецПроцедуры
